///////////////////////////////////////////////////////////
//  
//  Реализация 	Class CURVE_TYPE
//  Создана:   	01-мар-2010 13:46:28
//  Автор: 		Dr_Freeman
///////////////////////////////////////////////////////////

#pragma once

namespace Gepard
{
    namespace Curves
    {
        /**
         * Типы кривых
         */
        enum CURVE_3D_TYPE
        {
            /**
             * Не задана - только у GPDCurve
             */
            CT_NOT_DEFINED = 0,
            /**
             * Двумерная кривая методом натуральной параметризации
             */
            CT_GPD_CURVE2D = 1,
            /**
             * Трехмерная кривая методом натуральной параметризации
             */
            CT_GPD_CURVE3D = 2,
            /**
             * Эллипс
             */
            CT_ELLIPSE = 3,
            /**
             * Окружность
             */
            CT_CIRCLE = 4,
            /**
             * Гипербола
             */
            CT_HYPERBOLA = 5,
            /**
             * Парабола
             */
            CT_PARABOLA = 6,
            /**
             * кривая Безье
             */
            CT_BEZIER_CURVE = 7,
            /**
             * Просто линия
             */
            CT_LINE = 8,

            /**
             *	NURBS кривая
             */
            CT_NURBS = 9
        };

    }

}

