///////////////////////////////////////////////////////////
//  
//  Реализация 	Class ConfSpaceType
//  Создана:   	20-июл-2010 14:48:14
//  Автор: 		Dr_Freeman
///////////////////////////////////////////////////////////

#if !defined(EA_75B6CA31_8399_40bd_BAF0_FACA9007129A__INCLUDED_)
#define EA_75B6CA31_8399_40bd_BAF0_FACA9007129A__INCLUDED_

namespace Gepard
{
    namespace Tolerances
    {

        /** 
         *  Количество точек К.П. по умолчению
         */
        const int CS_SPHERE_PNUM = 4;
        const int CS_LINE_PNUM   = 2;
        const int CS_ARC_PNUM    = 2;

        /**
         * Типы конфигурационного пространства
         */
        enum ConfSpaceType
        {
            /**
             * Сегмент сферы - характеризуется двумя углами. Первый угол от 0 до макс., второй
             * угол от 0 до 2*Пи
             */
            CST_SPHERE_SEGMENT = 1,
            /**
             * Дуга - характеризуется одним углом от мин. до макс.
             */
            CST_ARC = 2,
            /**
             * Линия - характеризуется одним значением от мин. до макс.
             */
            CST_LINE = 3,
            /**
             * Круг - характеризуется знач. минимума и максимума
             */
            CST_CIRCLE = 4, 
            /**
             *	Заданное пользователем - может характеризоваться большим числом точек
             */
            CST_USERDEFINED = 5,
            /**
             *	Не задано
             */
             CST_UNDEFINED = 6
        };

    }

}
#endif // !defined(EA_75B6CA31_8399_40bd_BAF0_FACA9007129A__INCLUDED_)
