///////////////////////////////////////////////////////////
//  
//  –еализаци€ 	Class FixingRelationType
//  —оздана:   	16-сен-2010 14:19:31
//  јвтор: 		Dr_Freeman
///////////////////////////////////////////////////////////

#if !defined(EA_D4D7E17F_49A2_4575_96BB_49F4C96DA028__INCLUDED_)
#define EA_D4D7E17F_49A2_4575_96BB_49F4C96DA028__INCLUDED_

namespace Gepard
{
    namespace Assembly
    {
        /**
         * “ип условий закреплени€
         */
        enum FixingRelationType
        {
            /**
             * Ћинейное условие закреплени€ - закрепл€етс€ репер по векторам E1,E2,E3
             */
            FRT_LINEAR = 0,
            /**
             * «акрепление по кривой - закрепл€емый репер должен находитьс€ на заданной кривой
             * (т.е. вектор R репера)
             */
            FRT_CURVE = 1,
            /**
             * «акрепление по контакту с поверхностью - закрепл€емый репер должен быть на
             * заданной поверхности
             */
            FRT_SURFACE_CONTACT = 2, 
            /**
             *	«акрепление радиус-вектора R в пределах окружности
             */
            FRT_CIRCLE = 3
        };
    }

}
#endif // !defined(EA_D4D7E17F_49A2_4575_96BB_49F4C96DA028__INCLUDED_)
